---
kind: type
id: T:Autodesk.Revit.DB.CurveProjectionType
source: html/5669d7b4-2440-877f-5889-9390af7f8542.htm
---
# Autodesk.Revit.DB.CurveProjectionType

This attribute indicates how the curve will be projected to the surface if the curve is sketched on the surface.

## Syntax (C#)
```csharp
public enum CurveProjectionType
```